# Question 1: Consider the following Python module: What value is displayed when the last expression (a) is evaluated? Explain your answer by indicating what happens in every executed statement.

In [74]:
a = 0
def b():
    global a
    a = c(a)
def c(a):
    return a + 2

In [75]:
b()
b()
b()
a

6

In [76]:
b()
print(a)
b()
print(a)  # Since the scope of 'a' is  global, after each function call a is getting added by 2
b()
print(a)

8
10
12

# Question 2 :Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

In [72]:
def fileLength(file_name):
    try:
        infile = open(file_name)
        content = infile.read()
        infile.close()
        print(len(content))
    except:
         print(f'file {file_name} not found')

In [69]:
fileLength("midterm.py")

123

In [73]:
fileLength("idterm.py")

file idterm.py not found

# Question 3

In [77]:
class marsupial():
    
    def __init__(self):
        
        self.content = []
    
    def put_in_pouch(self,item):
        self.content.append(item)
        
    def pouch_contents(self):
        return self.content

In [78]:
m = marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [79]:
class kangaroo(marsupial):
    
    def __init__(self,x,y):
        marsupial.__init__(self)
        self.x = x
        self.y = y
    
    def jump(self,dx,dy):
        self.x +=dx
        self.y +=dy
        
    def __repr__(self):
        return 'I am a kangaroo located at coordinates({},{})'.format(self.x,self.y)

In [80]:
k = kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

I am a kangaroo located at coordinates(0,0)

['doll', 'firetruck', 'kitten']

In [81]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a kangaroo located at coordinates(3,0)

# Question 4 :
Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:x = {𝑥/2 𝑖𝑓 𝑥 𝑖𝑠 𝑒𝑣𝑒𝑛 3𝑥 + 1 𝑖𝑓 𝑥 𝑖𝑠 𝑜𝑑𝑑Your function should stop when the sequence gets to number 1. Your implementation must be recursive, without any loops

In [82]:
def collatz(n):
    list1 = n
    print(list1)
    if n == 1 :
        print(" ")
    elif n % 2 == 0 :
        list1=(collatz(n//2))     
    else:
        list1=(collatz(n*3+1))

In [83]:
collatz(1)

1

In [84]:
collatz(10)

10
5
16
8
4
2
1

# Question 5
Write a recursive method binary() that takes a non-negative 
integer n and prints the binary representation of integer n.

In [103]:
def binary(n):
    if n > 1:
        binary(n//2)
    
    print(n % 2,end = '')

In [104]:
binary(0)

0

In [105]:
binary(1)

1

In [106]:
binary(3)

11

In [107]:
binary(9)

1001

# Question 6

In [100]:
from html.parser import HTMLParser

In [148]:
class HeadingParser(HTMLParser):
    
    headers = ['h1','h2','h3','h4','h5','h6']
    
    ident = {'h1':0,'h2':1,'h3':3,'h4':4,'h5':5,'h6':6}
    
    head = None
    
    def handle_starttag(self,tag,attr):
        if tag in self.headers:
            self.head = tag
                
    def handle_data(self,data):
        if  self.head in self.headers:
            print(data.rjust(len(data)+self.ident[self.head]))

In [149]:
infile = open('D:\BDAT\Data Programming\W3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)

W3C Mission


 Principles

# Question 7

In [141]:
from urllib.request import urlopen
from urllib.parse import urljoin
from html.parser import HTMLParser

class urlcollect(HTMLParser):

  def __init__(self, url):
      
      HTMLParser.__init__(self)
      self.url = url
      self.links = []


  def first_tag(self, tag, attrs):
      if tag == 'a':
          for attr in attrs:          
              if attr[0] == 'href': 
                  absolute = urljoin(self.url, attr[1])
                  if absolute[:4] == 'http':
                      self.links.append(absolute)

  def getLinks(self):
    return self.links

Links = []
    
def webdir(url,depth,indent):
        global Links   
        print(indent*" " + url)
        if depth == 0:
            return 
        for i in Links: 
            webdir(i, depth-1, indent+1)

In [145]:
resource = urlopen(' http://reed.cs.depaul.edu/lperkovic/test1.html')
display = resource.read().decode()
linkcollect = urlcollect(' http://reed.cs.depaul.edu/lperkovic/test1.html')
linkcollect.feed(display)
Links = linkcollect.getLinks()


webdir(' http://reed.cs.depaul.edu/lperkovic/test1.html',2,0)

 http://reed.cs.depaul.edu/lperkovic/test1.html

# Question 8: Write SQL queries on the below database table that return:

In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\nimis\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Collecting sqlparse
  Downloading sqlparse-0.4.2-py3-none-any.whl (42 kB)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\nimis\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
Requirement already satisfied: six in c:\users\nimis\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in c:\users\nimis\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: pickleshare in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: backcall in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: traitlets>=4.2 in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: jedi>=0.16 in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: colorama in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: decorator in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: matplotlib-inline in c:\users\nimis\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\nimis\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\nimis\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\nimis\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=91da42c51792aa957914997e0654602907d680f984ca63fbc119b66954175611
  Stored in directory: c:\users\nimis\appdata\local\pip\cache\wheels\75\f7\28\77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.2

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql sqlite://

In [11]:
%%sql
CREATE TABLE Climate
(
  City Varchar(10), 
  Country Varchar(10),
  Season Varchar(10),
  Temperature float,
  Rainfall float
)

 * sqlite://
Done.

[]

In [12]:
%%sql
INSERT INTO Climate VALUES ('Mumbai', 'India','Winter', 24.8,5.9)

 * sqlite://
1 rows affected.

[]

In [16]:
%%sql
select * from Climate

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [15]:
%%sql
INSERT INTO Climate VALUES ('Mumbai', 'India','Spring', 28.4,16.2),
('Mumbai', 'India','Summer', 27.9,1549.4),
('Mumbai', 'India','Fall', 27.6,346.0),
('London', 'United Kingdom','Winter', 4.2,207.7),
('London', 'United Kingdom','Spring', 8.3,169.6),
('London', 'United Kingdom','Summer', 15.7,157.0),
('London', 'United Kingdom','Fall', 10.4,218.5),
('Cairo', 'Egypt','Winter', 13.6,16.5),
('Cairo', 'Egypt','Spring', 20.7,6.5),
('Cairo', 'Egypt','Summer', 27.7,0.1),
('Cairo', 'Egypt','Fall', 22.2,4.5)

 * sqlite://
11 rows affected.

[]

# a) All the temperature data.

In [18]:
%%sql
Select Temperature from Climate

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

# b) All the cities, but without repetition.

In [19]:
%%sql
Select distinct City from Climate

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

# c) All the records for India.

In [20]:
%%sql
Select * from Climate where Country ="India"

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

# d) All the Fall records.

In [21]:
%%sql
Select * from Climate where Season ="Fall"

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

# e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [25]:
%%sql
Select City,Country,Season from Climate where Rainfall  between 200 and 400

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

# f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [26]:
%%sql
Select City,Country from Climate where Season ="Fall" and Temperature >20 order by Temperature

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

# g) The total annual rainfall for Cairo.

In [27]:
%%sql
Select sum(Rainfall) from Climate where City ="Cairo"

 * sqlite://
Done.

[(27.6,)]

# h) The total rainfall for each season.

In [29]:
%%sql
Select Season,sum(Rainfall) from Climate Group by Season

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9

# a)
['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 
'LAZY', 'DOG']

In [123]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

In [124]:
a=[i.upper() for i in words]
a

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

# b)
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 
'lazy', 'dog']

In [125]:
b=[i.lower() for i in words]
b

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

# c)
[3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list 
words).

In [126]:
c=[len(i) for i in words]
c

[3, 5, 5, 3, 5, 4, 3, 4, 3]

# d)
the list containing a list for every word of list 
words, where each list contains the word in uppercase and lowercase and the 
length of the word.)

In [127]:
full_list=[[item[i] for item in [a,b,c]] for i in range(len(a))]
print(full_list)

[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

# e)
the list of words in list words containing 4 or more 
characters

In [131]:
[i for i in words if len(i)>=4]

['quick', 'brown', 'jumps', 'over', 'lazy']

In [132]:
[i for i in words if len(i)>=3]

['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']